name: "detection_preprocessing"
backend: "python"
max_batch_size: 1

input [
    {
        name: "detection_preprocessing_input"
        data_type: TYPE_UINT8
        dims: [ -1, -1, 3 ]
    }
]

output [
    {
        name: "OUTPUT_0"
        data_type: TYPE_FP32
        dims: [ -1, -1, 3 ]
    },
    {
        name: "OUTPUT_1"
        data_type: TYPE_FP32
        dims: [  4 ]
    }

]

instance_group [
  {
      count: 10
      kind: KIND_CPU
  }
]

    

