name: "ensemble_model"
platform: "ensemble"
max_batch_size: 0
input [
  {
    name: "input_image"
    data_type: TYPE_UINT8
    dims:  [ -1, -1, 3 ]
  }
]
output [
  {
    name: "rec_text"
    data_type: TYPE_STRING
    dims: [ -1 ]
  },
  {
    name: "rec_score"
    data_type: TYPE_FP32
    dims: [ -1 ]
  },
  {
    name: "dt_boxes"
    data_type: TYPE_FP32
    dims: [ -1, 4, 2 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "detection_preprocessing"
      model_version: -1
      input_map {
        key: "detection_preprocessing_input"
        value: "input_image"
      }
      output_map {
        key: "OUTPUT_0"
        value: "preprocessed_image"
      }
      output_map {
        key: "OUTPUT_1"
        value: "shape_list"
      }
    },
    {
      model_name: "text_detection"
      model_version: -1
      input_map {
        key: "x"
        value: "preprocessed_image"
      }
      output_map {
        key: "sigmoid_0.tmp_0"
        value: "detection_output"
      }
    },
    {
      model_name: "detection_postprocessing"
      model_version: -1
      input_map {
        key: "detection_postprocessing_input"
        value: "detection_output"
      }
      input_map {
        key: "detection_postprocessing_input_img"
        value: "input_image"
      }
      input_map {
        key: "detection_postprocessing_shape_list"
        value: "shape_list"
      }
      output_map {
        key: "dt_boxes"
        value: "dt_boxes"
      }
      output_map {
        key: "crop_imgs"
        value: "crop_imgs"
      }
    },
    {
      model_name: "text_recognition"
      model_version: -1
      input_map {
        key: "x"
        value: "crop_imgs"
      }
      output_map {
        key: "softmax_2.tmp_0"
        value: "recognition_output"
      }
    },
    {
      model_name: "recognition_postprocessing"
      model_version: -1
      input_map {
        key: "recognition_postprocessing_input"
        value: "recognition_output"
      }
      output_map {
        key: "recognition_postprocessing_output"
        value: "rec_text"
      }
      output_map {
        key: "recognition_postprocessing_output_score"
        value: "rec_score"
      }

    }
  ]
}

